1password
1password-cli
alfred
appcleaner
balenaetcher
burp-suite
chatgpt
claude
cursor
discord
docker
firefox
google-cloud-sdk
keepingyouawake
kitty
mongodb-compass
mullvad-vpn
notion
ollama
parsec
pdf-expert
postman
rectangle
scroll-reverser
slack
spotify
tableplus
telegram
wireshark
