tap "homebrew/core"
tap "homebrew/services"
tap "homebrew/cask"

tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "buo/cask-upgrade"
tap "eddieantonio/eddieantonio"

cask_args appdir: "/Applications"

# Brew
brew "autoenv"
brew "autojump"
brew "binwalk"
brew "fasd"
brew "fd"
brew "fish"
brew "fzf"
brew "git"
brew "git-lfs"
brew "gist"
brew "hexyl"
brew "irssi"
brew "jq"
brew "neofetch"
brew "neovim"
brew "pyenv"
brew "thefuck"
brew "tmux"
brew "unzip"
brew "vim"
brew "wget"
brew "yarn"
brew "mysql", restart_service: true
brew "postgresql", restart_service: true
brew "mongodb", restart_service: true
brew "eddieantonio/eddieantonio/imgcat"
brew "kubernetes-cli", link: false
brew "docker-machine-driver-hyperkit"

# Applications
## Development
cask "intellij-idea"
cask "rubymine"
cask "pycharm"
cask "goland"
cask "webstorm"
cask "clion"
cask "anaconda"
cask "android-studio"
cask "datagrip"
cask "docker"
cask "postman"
cask "paw"
cask "sequel-pro"
cask "sublime-text"
cask "visual-studio-code"
cask "vmware-fusion"
cask "iterm2"
cask "java"
cask "virtualbox"
cask "minikube"
cask "gitkraken"
cask "ngrok"

## Browsers
cask "google-chrome"
cask "firefox"

## Productivity
cask "alfred"
cask "dash"
cask "typora"
cask "notion"
cask "slack"
cask "bettertouchtool"

## Utilities
cask "anydesk"
cask "appcleaner"
cask "flux"
cask "hyperswitch"
cask "imageoptim"
cask "cyberduck"
cask "tunnelblick"
cask "dozer"
cask "macs-fan-control"
cask "google-backup-and-sync"
cask "qlcolorcode"
cask "qlstephen"
cask "qlmarkdown"
cask "quicklook-json"
cask "qlimagesize"
cask "webquicklook"
cask "suspicious-package"
cask "quicklookase"
cask "qlvideo"
cask "keybase"

## App
cask "between"
cask "discord"
cask "telegram"

## Fonts
cask "font-fira-code"
cask "font-hack-nerd-font"
cask "font-noto-sans-cjk-kr"
