tap "homebrew/core"
tap "homebrew/services"
tap "homebrew/cask"

tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "buo/cask-upgrade"
tap "eddieantonio/eddieantonio"

cask_args appdir: "/Applications"

# Brew
brew "autoenv"
brew "autojump"
brew "binwalk"
brew "fd"
brew "fzf"
brew "git"
brew "git-lfs"
brew "gist"
brew "hexyl"
brew "irssi"
brew "jq"
brew "neofetch"
brew "neovim"
brew "pyenv"
brew "thefuck"
brew "tmux"
brew "unzip"
brew "vim"
brew "wget"
brew "node"
brew "yarn"
brew "lazygit"
brew "bat"
brew "mysql", restart_service: true
brew "redis", restart_service: true
brew "postgresql", restart_service: true
brew "mongodb", restart_service: true
brew "eddieantonio/eddieantonio/imgcat"
brew "kubernetes-cli", link: false
brew "docker-machine-driver-hyperkit"
brew "htop"
brew "golang"
brew "socat"
brew "kompose"
brew "awscli"
brew "git-extras"
brew "hub"
brew "Schniz/tap/fnm"
brew "tree"

# Applications
## Development
cask "intellij-idea"
cask "rubymine"
cask "pycharm"
cask "goland"
cask "webstorm"
cask "clion"
cask "brackets"
cask "anaconda"
cask "android-studio"
cask "datagrip"
cask "docker"
cask "postman"
cask "paw"
cask "sequel-pro-nightly"
cask "sublime-text"
cask "visual-studio-code"
cask "vmware-fusion"
cask "iterm2"
cask "java"
cask "virtualbox"
cask "minikube"
cask "gitkraken"
cask "ngrok"

## Browsers
cask "google-chrome"

## Productivity
cask "alfred"
cask "dash"
cask "typora"
cask "notion"
cask "slack"

## Utilities
cask "anydesk"
cask "appcleaner"
cask "flux"
cask "hyperswitch"
cask "imageoptim"
cask "cyberduck"
cask "tunnelblick"
cask "dozer"
cask "macs-fan-control"
cask "google-backup-and-sync"
cask "keybase"
cask "keka"
cask "termhere"
cask "toggl"
cask "shortcat"
cask "mysqlworkbench"
cask "spotify"
cask "parallels"
cask "istat-menus"
cask "fantastical"
cask "pdf-expert"
cask "karabiner-elements"
cask "teamviewer"
cask "rescuetime"

## Fonts
cask "font-hack"
cask "font-cascadia"
